modules/Tour/Controllers/TourController.php

select * from `bc_tour_category` where `status` = 'publish' and `bc_tour_category`.`deleted_at` is null
select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null limit 1000
---
        public function index(Request $request)
        {
            $is_ajax = $request->query('_ajax');
            $list = call_user_func([$this->tourClass,'search'],$request);
            $markers = [];
            if (!empty($list)) {
                foreach ($list as $row) {
                    $markers[] = [
                        "id" => $row->id,
                        "title" => $row->title,
                        "lat" => (float)$row->map_lat,
                        "lng" => (float)$row->map_lng,
                        "gallery" => $row->getGallery(true),
                        "infobox" => view('Tour::frontend.layouts.search.loop-grid', ['row' => $row, 'disable_lazyload' => 1, 'wrap_class' => 'infobox-item'])->render(),
                        'marker' => get_file_url(setting_item("tour_icon_marker_map"),'full') ?? url('images/icons/png/pin.png'),
                    ];
                }
            }
            $limit_location = 15;
            if( empty(setting_item("space_location_search_style")) or setting_item("space_location_search_style") == "normal" ){
                $limit_location = 1000;
            }
            $data = [
                'rows' => $list,
                'tour_category' => $this->tourCategoryClass::where('status', 'publish')->with(['translations'])->get()->toTree(),
                'tour_location' => $this->locationClass::where('status', 'publish')->with(['translations'])->limit($limit_location)->get()->toTree(),

select * from `bc_attrs` where `service` = 'tour' and `bc_attrs`.`deleted_at` is null order by `position` desc
---
                    "markers" => $data['markers']
                ]);
            }
            $data['attributes'] = $this->attributesClass::where('service', 'tour')->orderBy("position","desc")->with(['terms'=>function($query){
                $query->withCount('tour');
            },'translations'])->get();

select * from `bc_locations` where `bc_locations`.`id` in (1) and `bc_locations`.`deleted_at` is null
select * from `bc_tours` where `slug` = 'cannes-and-antibes-night-tour' and `bc_tours`.`deleted_at` is null limit 1
select * from `bc_tours` where `location_id` = 1 and `status` = 'publish' and `id` not in (15) and `bc_tours`.`deleted_at` is null limit 4
---
        public function detail(Request $request, $slug)
        {
            $row = $this->tourClass::where('slug', $slug)->with(['location','translations','hasWishList'])->first();
            if ( empty($row) or !$row->hasPermissionDetailView()) {
                return redirect('/');
            }
            $translation = $row->translateOrOrigin(app()->getLocale());
            $tour_related = [];
            $location_id = $row->location_id;
            if (!empty($location_id)) {
                $tour_related = $this->tourClass::where('location_id', $location_id)->where("status","publish")->take(4)->whereNotIn('id', [$row->id])->with(['location','translations','hasWishList'])->get();