modules/Template/Blocks/FormSearchAllService.php

    public function content($model = [])
    {
        $model['bg_image_url'] = FileHelper::url($model['bg_image'] ?? "", 'full') ?? "";
        $model['list_location'] = $model['tour_location'] =  Location::where("status","publish")->limit(1000)->orderBy('name', 'asc')->with(['translations'])->get()->toTree();
        $model['style'] = !empty($model['style']) ? $model['style'] :  "style_1";
        $model['list_slider'] = $model['list_slider'] ?? "";
        $model['modelBlock'] = $model;
        $model['seatType'] =  SeatType::get();
---
select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null order by `name` asc limit 1000
select * from `bc_seat_type` where `bc_seat_type`.`deleted_at` is null