modules/Template/Blocks/ListServicesByLocation.php

    function __construct()
    {
        $list_service = $list_location = [];
        $locations = Location::where("status","publish")->limit(1000)->orderBy('name', 'asc')->with(['translations'])->get()->toTree();
---
select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null order by `name` asc limit 1000