modules/Tour/Models/Tour.php

    public function getNumberAvailableBooking($start_date)
    {
        $tourDate = $this->tourDateClass::where('target_id', $this->id)->where('start_date', $start_date)->where('active', 1)->first();
        $totalGuests = $this->bookingClass::where('object_id', $this->id)->where('start_date', $start_date)->whereNotIn('status', $this->bookingClass::$notAcceptedStatus)->sum('total_guests');
---
select * from `bc_tour_dates` where `target_id` = 15 and `start_date` = '2022-06-25 00:00:00' and `active` = 1 limit 1
select sum(`total_guests`) as aggregate from `bc_bookings` where `object_id` = 15 and `start_date` = '2022-06-25 00:00:00' and `status` not in ('draft', 'cancelled', 'unpaid') and `bc_bookings`.`deleted_at` is null

    public function isAvailableInRanges($start_date){

        if($this->default_state)
        {
            $notAvailableDates = $this->tourDateClass::query()->where([
                ['start_date','>=',$start_date],
                ['end_date','<=',$start_date],
                ['active','0'],
                ['target_id','=',$this->id],
            ])->count('id');
---
select count(`id`) as aggregate from `bc_tour_dates` where (`start_date` >= '2022-06-24' and `end_date` <= '2022-06-24' and `active` = '0' and `target_id` = 15)

    public function getReviewDataAttribute()
    {
        $list_score = [
            'score_total'  => 0,
            'score_text'   => __("Not Rated"),
            'total_review' => 0,
            'rate_score'   => [],
        ];
        $dataTotalReview = $this->reviewClass::selectRaw(" AVG(rate_number) as score_total , COUNT(id) as total_review ")->where('object_id', $this->id)->where('object_model', "tour")->where("status", "approved")->first();
        if (!empty($dataTotalReview->score_total)) {
            $list_score['score_total'] = number_format($dataTotalReview->score_total, 1);
            $list_score['score_text'] = $this->reviewClass::getDisplayTextScoreByLever(round($list_score['score_total']));
        }
        if (!empty($dataTotalReview->total_review)) {
            $list_score['total_review'] = $dataTotalReview->total_review;
        }
        $list_data_rate = $this->reviewClass::selectRaw('COUNT( CASE WHEN rate_number = 5 THEN rate_number ELSE NULL END ) AS rate_5,
                                                            COUNT( CASE WHEN rate_number = 4 THEN rate_number ELSE NULL END ) AS rate_4,
                                                            COUNT( CASE WHEN rate_number = 3 THEN rate_number ELSE NULL END ) AS rate_3,
                                                            COUNT( CASE WHEN rate_number = 2 THEN rate_number ELSE NULL END ) AS rate_2,
                                                            COUNT( CASE WHEN rate_number = 1 THEN rate_number ELSE NULL END ) AS rate_1 ')->where('object_id', $this->id)->where('object_model', $this->type)->where("status", "approved")->first()->toArray();
---
select  AVG(rate_number) as score_total , COUNT(id) as total_review  from `bc_review` where `object_id` = 15 and `object_model` = 'tour' and `status` = 'approved' and `bc_review`.`deleted_at` is null limit 1
select COUNT( CASE WHEN rate_number = 5 THEN rate_number ELSE NULL END ) AS rate_5,
COUNT( CASE WHEN rate_number = 4 THEN rate_number ELSE NULL END ) AS rate_4,
COUNT( CASE WHEN rate_number = 3 THEN rate_number ELSE NULL END ) AS rate_3,
COUNT( CASE WHEN rate_number = 2 THEN rate_number ELSE NULL END ) AS rate_2,
COUNT( CASE WHEN rate_number = 1 THEN rate_number ELSE NULL END ) AS rate_1  from `bc_review` where `object_id` = 15 and `object_model` = 'tour' and `status` = 'approved' and `bc_review`.`deleted_at` is null limit 1

    public function getScoreReview()
    {
        $tour_id = $this->id;
        $list_score = Cache::rememberForever('review_' . $this->type . '_' . $tour_id, function () use ($tour_id) {
            $dataReview = $this->reviewClass::selectRaw(" AVG(rate_number) as score_total , COUNT(id) as total_review ")->where('object_id', $tour_id)->where('object_model', "tour")->where("status", "approved")->first();
---
select  AVG(rate_number) as score_total , COUNT(id) as total_review  from `bc_review` where `object_id` = 15 and `object_model` = 'tour' and `status` = 'approved' and `bc_review`.`deleted_at` is null limit 1

    public function getNumberServiceInLocation($location)
    {
        $number = 0;
        if (!empty($location)) {
            $number = parent::join('bc_locations', function ($join) use ($location) {
                $join->on('bc_locations.id', '=', 'bc_tours.location_id')->where('bc_locations._lft', '>=', $location->_lft)->where('bc_locations._rgt', '<=', $location->_rgt);
            })->where("bc_tours.status", "publish")->with(['translations'])->count("bc_tours.id");
---
select count(`bc_tours`.`id`) as aggregate from `bc_tours` inner join `bc_locations` on `bc_locations`.`id` = `bc_tours`.`location_id` and `bc_locations`.`_lft` >= 23 and `bc_locations`.`_rgt` <= 24 where `bc_tours`.`status` = 'publish' and `bc_tours`.`deleted_at` is null

    public function getReviewList(){
        return $this->reviewClass::select(['id','title','content','rate_number','author_ip','status','created_at','vendor_id','create_user'])
            ->where('object_id', $this->id)
            ->where('object_model', 'tour')
            ->where("status", "approved")
            ->orderBy("id", "desc")
            ->with('author')
            ->paginate(setting_item('tour_review_number_per_page', 5));
---
select `id`, `title`, `content`, `rate_number`, `author_ip`, `status`, `created_at`, `vendor_id`, `create_user` from `bc_review` where `object_id` = 15 and `object_model` = 'tour' and `status` = 'approved' and `bc_review`.`deleted_at` is null order by `id` desc limit 5 offset 0
select count(*) as aggregate from `bc_review` where `object_id` = 15 and `object_model` = 'tour' and `status` = 'approved' and `bc_review`.`deleted_at` is null

        }else{
            $limit = !empty(setting_item("tour_page_limit_item"))? setting_item("tour_page_limit_item") : 9;
        }
        return $model_Tour->with([
            'location',
            'hasWishList',
            'translations',
            'categoryTour'
        ])->paginate($limit);
---
select * from `bc_locations` where `bc_locations`.`id` in (2, 3, 4, 5, 6, 8, 11) and `bc_locations`.`deleted_at` is null

    public function dataForApi($forSingle = false)
    {
        $data = parent::dataForApi($forSingle);
        $data['duration'] = duration_format($this->duration);
        if ($forSingle) {
            $data['review_score'] = $this->getReviewDataAttribute();
            $data['review_stats'] = $this->getReviewStats();
            $data['review_lists'] = $this->getReviewList();
            $data['category'] = TourCategory::selectRaw("id,name")->find($this->category_id) ?? null;
---
select * from `bc_tour_category` where `bc_tour_category`.`id` in (1, 2, 3, 4) and `bc_tour_category`.`deleted_at` is null