app/User.php

        public function getMeta($key, $default = '')
        {
            $val = DB::table('user_meta')->where([
                'user_id' => $this->id,
                'name'    => $key
            ])->first();
---
select * from `user_meta` where (`user_id` = 1 and `name` = 'social_meta_avatar') limit 1

        public static function countVerifyRequest(){
            return parent::query()->whereIn('verify_submit_status',['new','partial'])->count(['id']);
---
select count(`id`) as aggregate from `users` where `verify_submit_status` in ('new', 'partial') and `users`.`deleted_at` is null