modules/Tour/Admin/TourController.php

    public function index(Request $request)
    {
        $this->checkPermission('tour_view');
        $query = $this->tourClass::query();
        $query->orderBy('id', 'desc');
        if (!empty($tour_name = $request->input('s'))) {
            $query->where('title', 'LIKE', '%' . $tour_name . '%');
            $query->orderBy('title', 'asc');
        }
        if (!empty($cate = $request->input('cate_id'))) {
            $query->where('category_id', $cate);
        }
        if ($this->hasPermission('tour_manage_others')) {
            if (!empty($author = $request->input('vendor_id'))) {
                $query->where('create_user', $author);
            }
        } else {
            $query->where('create_user', Auth::id());
        }
        $data = [
            'rows'               => $query->with(['getAuthor'])->paginate(20),
            'tour_categories'    => $this->tourCategoryClass::where('status', 'publish')->get()->toTree(),
            'tour_manage_others' => $this->hasPermission('tour_manage_others'),
            'page_title'         => __("Adventure Management"),
            'breadcrumbs'        => [
                [
                    'name' => __('Adventure'),
                    'url'  => 'admin/module/tour'
                ],
                [
                    'name'  => __('All'),
                    'class' => 'active'
                ],
            ]
        ];
---
select * from `users` where `users`.`id` in (1, 2) and `users`.`deleted_at` is null
select * from `bc_tour_category` where `status` = 'publish' and `bc_tour_category`.`deleted_at` is null

    public function edit(Request $request, $id)
    {
        $this->checkPermission('tour_update');
        $row = $this->tourClass::find($id);
        if (empty($row)) {
            return redirect('admin/module/tour');
        }
        $translation = $row->translateOrOrigin($request->query('lang'));
        if (!$this->hasPermission('tour_manage_others')) {
            if ($row->create_user != Auth::id()) {
                return redirect('admin/module/tour');
            }
        }
        $data = [
            'row'               => $row,
            'translation'       => $translation,
            "selected_terms"    => $row->tour_term->pluck('term_id'),
            'attributes'        => $this->attributesClass::where('service', 'tour')->get(),
            'tour_category'     => $this->tourCategoryClass::where('status', 'publish')->get()->toTree(),
            'tour_location'     => $this->locationClass::where('status', 'publish')->get()->toTree(),
            'location_category' => $this->locationCategoryClass::where("status", "publish")->get(),
---
select * from `bc_tours` where `bc_tours`.`id` = '97' and `bc_tours`.`deleted_at` is null limit 1
select * from `bc_attrs` where `service` = 'tour' and `bc_attrs`.`deleted_at` is null
select * from `bc_tour_category` where `status` = 'publish' and `bc_tour_category`.`deleted_at` is null
select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null
select * from `location_category` where `status` = 'publish' and `location_category`.`deleted_at` is null