modules/Booking/Controllers/BookingController.php

    protected function validateCheckout($code){

        if(!is_enable_guest_checkout() and !Auth::check()){
            $is_api = request()->segment(1) == 'api';
            if($is_api){
                return $this->sendError(__("You have to login in to do this"))->setStatusCode(401);
            }else{
                redirect('/');
            }
        }
        $booking = $this->booking::where('code', $code)->first();
---
select * from `bc_bookings` where `code` = '9b01ac871e181b47fae5b7d5aedd3c64' and `bc_bookings`.`deleted_at` is null limit 1

    public function checkStatusCheckout($code)
    {
        $booking = $this->booking::where('code', $code)->first();
---
select * from `bc_bookings` where `code` = '9b01ac871e181b47fae5b7d5aedd3c64' and `bc_bookings`.`deleted_at` is null limit 1

    protected function validateDoCheckout(){

        $request = \request();
        if(!is_enable_guest_checkout() and !Auth::check()){
            return $this->sendError(__("You have to login in to do this"))->setStatusCode(401);
        }

        if(Auth::user() && !Auth::user()->hasVerifiedEmail() && setting_item('enable_verify_email_register_user') == 1){
            return $this->sendError(__("You have to verify email first"), ['url' => url('/email/verify')]);
        }
        /**
         * @param Booking $booking
         */
        $validator = Validator::make($request->all(), [
            'code' => 'required',
        ]);
        if ($validator->fails()) {
            return $this->sendError('', ['errors' => $validator->errors()]);
        }
        $code = $request->input('code');

        $booking = $this->booking::where('code', $code)->first();
---
select * from `bc_bookings` where `code` = 'c672306187b13842103730854ef987f8' and `bc_bookings`.`deleted_at` is null limit 1

    public function detail(Request $request, $code)
    {
        if(!is_enable_guest_checkout() and !Auth::check()){
            return $this->sendError(__("You have to login in to do this"))->setStatusCode(401);
        }

        $booking = Booking::where('code', $code)->first();
---
select * from `bc_bookings` where `code` = '47c5d0cfec8f6a8820e60cad2185e908' and `bc_bookings`.`deleted_at` is null limit 1