modules/Booking/Models/Booking.php

    public function getMeta($key, $default = '')
    {
        $val = DB::table('bc_booking_meta')->where([
            'booking_id' => $this->id,
            'name'       => $key
        ])->first();
---
select * from `bc_booking_meta` where (`booking_id` = 9 and `name` = 'person_types') limit 1

    public function addMeta($key, $val, $multiple = false)
    {

        if (is_object($val) or is_array($val))
            $val = json_encode($val);
        if ($multiple) {
            return DB::table('bc_booking_meta')->insert([
                'name'       => $key,
                'val'        => $val,
                'booking_id' => $this->id
            ]);
        } else {
            $old = DB::table('bc_booking_meta')->where([
                'booking_id' => $this->id,
                'name'       => $key
            ])->first();
            if ($old) {

                return DB::table('bc_booking_meta')->where('id', $old->id)->update([
                    'val' => $val
                ]);

            } else {
                return DB::table('bc_booking_meta')->insert([
                    'name'       => $key,
                    'val'        => $val,
                    'booking_id' => $this->id
                ]);
---
select * from `bc_booking_meta` where (`booking_id` = 9 and `name` = 'locale') limit 1
insert into `bc_booking_meta` (`name`, `val`, `booking_id`) values ('locale', 'en', 9)

    public function sendNewBookingEmails()
    {
        try {
            // To Admin
            Mail::to(setting_item('admin_email'))->send(new NewBookingEmail($this, 'admin'));

            // to Vendor
            Mail::to(User::find($this->vendor_id))->send(new NewBookingEmail($this, 'vendor'));
---
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1

    public static function getRecentBookings($limit = 10)
    {

        $q = parent::where('status', '!=', 'draft');
        return $q->orderBy('id', 'desc')->limit($limit)->get();
---
select * from `bc_bookings` where `status` != 'draft' and `bc_bookings`.`deleted_at` is null order by `id` desc limit 10

    public static function getTopCardsReport()
    {

        $res = [];
        $total_data = parent::selectRaw('sum(`total`) as total_price , sum( `total` - `total_before_fees` + `commission` - `vendor_service_fee_amount` ) AS total_earning ')->whereNotIn('status',static::$notAcceptedStatus)->first();
        $total_booking = parent::whereNotIn('status',static::$notAcceptedStatus)->count('id');
---
select sum(`total`) as total_price , sum( `total` - `total_before_fees` + `commission` - `vendor_service_fee_amount` ) AS total_earning  from `bc_bookings` where `status` not in ('draft', 'cancelled', 'unpaid') and `bc_bookings`.`deleted_at` is null limit 1
select count(`id`) as aggregate from `bc_bookings` where `status` not in ('draft', 'cancelled', 'unpaid') and `bc_bookings`.`deleted_at` is null

    public static function clearDraftBookings($day = 2)
    {
        $q = static::query();
        $q->where([
            ['created_at','<=',date('Y-m-d H:i:s', strtotime('-'.$day.' days'))],
            ['status','=','draft']
        ])->forceDelete();
---
delete from `bc_bookings` where (`created_at` <= '2022-06-19 09:54:24' and `status` = 'draft')

    public function getCommissionVendor(){
        $vendorId = $this->vendor_id;
        $total = $this->total_before_fees;
        $returnArray=[
            'commission'=>0,
            'commission_type'=>'',
        ];
        if (setting_item('vendor_enable') == 1) {
            $vendor = User::find($vendorId);
---
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1