app/Http/Controllers/HomeController.php

select * from `core_pages` where `id` = 4 and `status` = 'publish' and `core_pages`.`deleted_at` is null limit 1
---
    public function index()
    {
        $home_page_id = setting_item('home_page_id');
        $home_page_id = 4;

        if($home_page_id && $page = Page::where("id",$home_page_id)->where("status","publish")->first())