modules/Tour/Blocks/ListTours.php

select * from `bc_locations` where `bc_locations`.`id` in (11) and `bc_locations`.`deleted_at` is null
---
        $model_Tour->where("bc_tours.status", "publish");
        $model_Tour->with('location');
        $model_Tour->groupBy("bc_tours.id");
        return $model_Tour->limit($model['number'])->get();