modules/Location/Blocks/ListLocations.php

select * from `bc_locations` where `status` = 'publish' and `bc_locations`.`deleted_at` is null order by `id` asc limit 7
---
    public function query($model){
        if(empty($model['order'])) $model['order'] = "id";
        if(empty($model['order_by'])) $model['order_by'] = "desc";
        if(empty($model['number'])) $model['number'] = 5;
        if (empty($model['service_type']))
            return '';
        $model_location = Location::query()->with(['translations']);
        $model_location->where("status","publish");
        if(!empty( $model['custom_ids'] )){
            $model_location->whereIn("id",$model['custom_ids']);
        }
        $model_location->orderBy($model['order'], $model['order_by']);
        return $model_location->limit($model['number'])->get();