modules/Core/Admin/SettingsController.php

select * from `core_settings` where `name` = 'vendor_enable' limit 1
---
                    }
                    $setting_key = $key.($lang ? '_'.$lang : '');

                    $check = Settings::where('name', $setting_key)->first();